app/controllers/player_controller.rb

  def identify
    if params[:player].present?
      name = params[:player]
      session[:player] = name
      unless Player.find_by_name(name)
        p = Player.new()
        p.name = name
        p.save
---
SELECT * FROM "players" WHERE ("players"."name" = 'Pablo') LIMIT 1
INSERT INTO "players" ("name", "created_at", "strain", "updated_at", "clock", "recovery", "recovery_clock", "strain_clock") VALUES('Pablo', '2011-07-26 13:31:29', 0, '2011-07-26 13:31:29', 1, 0, 0, 0)

  def logout
    reset_session
    if @player
      @player.destroy
---
DELETE FROM "players" WHERE "id" = 4

  def set_player
    if session[:player].present?
      @player = Player.find_by_name(session[:player])
---
SELECT * FROM "players" WHERE ("players"."name" = 'Pablo') LIMIT 1